.. _ird_userguide:

IRD Strings
============

Introduction
------------

The function :func:`clean_nz_ird() <dataprep.clean.clean_nz_ird.clean_nz_ird>` cleans a column containing New Zealand IRD number (IRD) strings, and standardizes them in a given format. The function :func:`validate_nz_ird() <dataprep.clean.clean_nz_ird.validate_nz_ird>` validates either a single IRD strings, a column of IRD strings or a DataFrame of IRD strings, returning `True` if the value is valid, and `False` otherwise.

IRD strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "49091850"
* `standard`: IRD strings with proper whitespace in the proper places, like "49-091-850"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_nz_ird()` and `validate_nz_ird()`.

### An example dataset containing IRD strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ird": [
            "49091850",
            "136410133",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              ird                                           address
0        49091850                                     123 Pine Ave.
1       136410133                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_nz_ird`

By default, `clean_nz_ird` will clean ird strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_nz_ird
clean_nz_ird(df, column = "ird")

,ird,address,ird_clean
0,49091850,123 Pine Ave.,49-091-850
1,136410133,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_nz_ird(df, column = "ird", output_format="standard")

,ird,address,ird_clean
0,49091850,123 Pine Ave.,49-091-850
1,136410133,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_nz_ird(df, column = "ird", output_format="compact")

              ird                                           address ird_clean
0        49091850                                     123 Pine Ave.  49091850
1       136410133                                           main st       NaN
2     51824753556                      1234 west main heights 57033       NaN
3  51 824 753 556                    apt 1 789 s maple rd manhattan       NaN
4           hello                robie house, 789 north main street       NaN
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles       NaN
6            NULL                                             hello       NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned IRD strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_nz_ird(df, column="ird", inplace=True)

    ird_clean                                           address
0  49-091-850                                     123 Pine Ave.
1         NaN                                           main st
2         NaN                      1234 west main heights 57033
3         NaN                    apt 1 789 s maple rd manhattan
4         NaN                robie house, 789 north main street
5         NaN  (staples center) 1111 S Figueroa St, Los Angeles
6         NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_nz_ird(df, "ird", errors="coerce")

,ird,address,ird_clean
0,49091850,123 Pine Ave.,49-091-850
1,136410133,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_nz_ird(df, "ird", errors="ignore")

,ird,address,ird_clean
0,49091850,123 Pine Ave.,49-091-850
1,136410133,main st,136410133
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_nz_ird()`

`validate_nz_ird()` returns `True` when the input is a valid IRD. Otherwise it returns `False`.

The input of `validate_nz_ird()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_nz_ird()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_nz_ird()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_nz_ird
print(validate_nz_ird("49091850"))
print(validate_nz_ird("136410133"))
print(validate_nz_ird("51824753556"))
print(validate_nz_ird("51 824 753 556"))
print(validate_nz_ird("hello"))
print(validate_nz_ird(np.nan))
print(validate_nz_ird("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_nz_ird(df["ird"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ird, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_nz_ird(df, column="ird")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ird, dtype: bool

### Only DataFrame

In [11]:
validate_nz_ird(df)

     ird  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False